FROM python:slim

# Встановлення змінних середовища для:
# 1. Запобігання створенню файлів .pyc Python (компіляція до байт-коду).
# 2. Відключення буферизації виводу Python (для кращого логування).
# Це також зменшує розмір Docker-образу.
ENV PYTHONDONTWRITEBYTECODE=1 \
    PYTHONUNBUFFERED=1

# Встановіть робочу директорію для контейнера
WORKDIR /app

# Скопіюйте лише файл із залежностями для встановлення пакетів
COPY requirements.txt requirements.txt

# Встановіть необхідні пакети, але без кешування, щоб зменшити розмір образу
RUN pip install --no-cache-dir -r requirements.txt

# Скопіюйте увесь код застосунку в контейнер
COPY . /app

# Виконайте навчання моделі перед запуском застосунку
# RUN python .py

# Відкрийте порт 80, який буде використовувати Flask
EXPOSE 5000

# Команда для запуску застосунку
CMD ["python", "calc.py"]